#include <iostream>
using namespace std;

void main()
{
	// 자료구조와 알고리즘

	// 알고리즘은 그냥 로직, 로직인데 보편적으로 많이 사용하는 로직

	// 자료구조란,
	// 내가 데이터를 저장할 건데, 저장할 수 있는 구조.
	// 1. 정적배열
	// 2. 동적배열
	// 3. vector에 저장할 수 있다.

	// 자료구조
	// 플레이어 100마리의 체력 데이터
	// int monsterHP[100] = {};
	// int *monsterHP = new int[100]{};
	// vector<int> monsterHP = {};

	// 저장할 수 있는 방법이 굉장히 많다.
	// 각 방법들 마다 장단점이 갈리기에
	// 장점/단점에 따라서 잘 적용할 수 있어야함.

	// 자료구조에는 크게 2가지로 나눌 수 있다.
	// 1. 선형 구조(데이터가 한 방향으로 연결되어 있다.)
	//		=> 배열, 벡터, 힙, 스택
	// 2. 비선형 구조(데이터가 여러 방향으로 연결되어 있다. // 가지가 쳐져있다)
	//		=> 트리
}