#include "pch.h"

void Summary()
{
	// 1. InputManager
	//  => 키입력 , 마우스입력 등을 관리하는 매니저

	// 2. 충돌체크
	//   게임개발할때 필수인 내용

	// 3. Vector 2D
	//  게임수학에 들어가는 x, y


	// 프레임워크 제작할떄는 
	//--> 모듈, 게임수학을 주로 다루게 됩니다.


	// 모듈을 만들때 최대한 Unity랑 비슷하게 진행하려고하는데
	// 왜 Unreal이 아니고 Unity로 하는가??

	// 저번기수떄는 Unreal기준으로 했습니다.
	// 사실 큰차이가 없어요.
	// 근데 제가 이름이 기억이 잘나는게 Unity라서..

	// 거의 이름만 바뀝니다.
	// 유니티에서는 OnTriggerEnter라고 부르는게
	// 언리얼에서는 OnOverlapped
	// 이름만 다르게 불리는..

	// Unity랑 Unreal이랑 핵심기술이 다르면
	// 저희가 Windows API를 배울필요가 없습니다.

	// 거기에 편의성기능으로 더 들어가있는거에요

	//사전조사 했을때
	// 저번기수때는 언리얼이 더많았고
	// 이번기수는 유니티로 해보신분들이 더많았어서 (조금이나마)

	// C++을 배웠으니 언리얼을 해야지 << 이거또한 틀려요.
	// 이 수업에서 C#도 배웁니다.
	// 서버할때 C#합니다.
	// C#배우는거 1주일 걸립니다.
	// (C++안다는 가정)
}