void Summary()
{
	// 1. 리소스 매니저
	
	// 리소스 매니저
	// 게임할 때 외부 파일(오디오 ,3D모델링, 텍스처, 애니메이션 파일 etc)
	// 매니저 객체
	// 주요 기능 ::  [리소스 로드][리소스 가져오기]

	// 프레임워크에서 매니저
	// -> 기본적으로 엔진에서 보통 지원

	// Windows API를 활용해서 게임을 만들고 있기에
	// Windows 에서밖에 안 돌아감

	// IOS, Android
	// OS마다 리소스를 로딩하는 방식이 원래 다 다름
	// Windows API에서 제공해주는 이미지 로딩
	
	// Android (JAVA)
	// Android API에서 제공해주는 이미지 로딩
	
	// IOS (Swift, Object-C)
	// Swift, Object-C에서 제공해주는 이미지로딩 API를 활용

	// Load함수에서
	// 처음보는 함수들 되게 많이 나옴
	//		-> 외울 필요 없음
	// -> 엔진의 기능을 직접 구현해 보는 것에 의의
	// 리소스 매니저는 100퍼센트 이해할 필요는 없음.
}

void Comment01()
{
	//디버깅 할 때는 상대경로 기준을
	// .vcxproj 파일을 기준으로
	//배포할 때는 
	// .exc기준 파일을 기준으로
}

void Commnet02()
{
	// 숙제
	// 해머로 때렸을 때 -> 해머가 내려치는 모션이 되어야함.
	// 두더지를 잡았을 때 -> 두더지 우는 모습 1초 나와야함.
}