#include <iostream>
using namespace std;

void main()
{
	// 1. Windows API 배우는 이유 

	// - 기본적으로 게임 회사에 들어가면, windows API로 코딩 안함
	// - 배우는 이유?

	// 게임 엔진에서 해주는 일을 직접 구현

	// 그러면 어떤 걸 배울 수 있나?
	// 어떤 함수가 부하가 높고 어떻게 하면 게임이 최적화가 덜 되는지

	// Unity, Ureal Engine
	// 갑자기 게임이 느려져 << 이러면 이때부터 퍼포먼스 테스트를 시작
	// 구조부터가 잘못되었다는 걸 다 만들어갈 때쯤 깨닫게 됨
	// 모든걸 직접 구현해보기 때문에
	// 어떤 게임 엔진을 배우든
	// 이런 식으로 코딩하면 게임을 만들 수 있겠구나

	// Windows Api는
	// 문법을 배우려고 수업을 듣는 게 아님
	// 그냥 갖다 쓸 수 있을정도만 흡수
	// 프레임 워크의 구성 요소들이 어떻게 만들어지는 지 기억할 정도

	// Windows API로 게임엔진 못 만듦.
	// Direct X까지 붙여서 게임엔진을 만들면 되는 거 아닌지? >> 그러기엔 수업시간 부족.
	// 그러려면 Direct X만 1년 넘게 해야함.

	// ----------------------------------

}