#include "pch.h"

void Comment01()
{
	// 1. Tilemap 의 Resource 적용.
	// 2. 맵툴 제작
	//	- (툴 제작) 게임 제작에 필수적인 요소
}

void Comment02()
{
	// 실습
	// 수업자료에 올린 이미지를 활용해서
	// 화면에 보이는 포켓몬스터 맵화면 띄우기

	// 오늘 숙제
	// 포켓몬스터 맵 화면 만들기
}

void Comment03()
{
	// 맵 툴 제작
	// - 맵 툴이란?

	// Map Tool 
	// 직역 : 맵 제작 도구
	// 저희는 게임을 제작하는 건데, 맵 제작하는 걸 왜 만듦?
	// 그래픽 디자이너가 모든 맵을 만들어주진 않음.
	// 타일맵일 경우에, 타일들만 그려주지, 맵을 그려주진 않음..
	// 기획자가 맵을 제작 -> 기획자가 맵을 제작할 때, 프로그래머가 만들어준 맵 제작 도구(맵 툴)을 사용

	// 기획자가 만든(데이터) + 프로그래머가 만든 (게임 로직)
	// => 게임(데이터 - File + 로직)
	
	// 수치조정 밸런스패치
	// - 프로그래머가 작업 XX
	
	// 씬에서 마우스 좌 클릭을 하면 해당 타일이 변하도록 (value + 1)
	// Value가 Max를 넘어가면 0으로 변경
	// 타일 셋을 포켓몬스터 타일셋으로 변경하고 시작.
}

void Comment04()
{
	// 맵툴로 만든 맵 데이터를 파일로 저장하기
	// 맵 데이터를 불러오기

}