void Summary()
{
	// 1. 숙제풀이 (구구단 출력)
	// 2. 씬매니저 (씬 구분가능 하도록) (Homework1, Homework2)
	// 3. 게임수학 (앞으로 계속 틈틈히)
}

void Homework()
{
	// Windows API 왔다고해서
	// 수도코드를 안쓰지 않습니다.
	// 수도코드는 항상 따라다녀요.

	//(구구단 출력)

	// 수도코드 
	// 상황별로 맞게

	// Init (게임시작할떄 처음)
	//	- 구구단 상자 9개 변수를 만들어야함.		(상자 변수는 vector<RECT> gugudan라는 자료형을 사용합니다.)
	//	- 현재단 = 0 초기화

	// Update (매프레임) (Update => 변수를 변경해주는곳)
	//	- 
	//  if( 마우스좌클릭했을때 ) 
	//  {
	//		for( 구구단상자 )
	//		{
	//			if( PtInRect (구구단상자[i], 마우스좌표) ) 
	//			{  
	//				현재 단 = 몇번째 구구단상자를 클릭했는지 저장. 
	//			}
	//		}
	//	}

	// Render (매프레임) (Render => 그림을 그리는곳)
	//	-	if( 현재 단 != 0)
	//		{
	//			마우스 주변으로 구구단 그려주기.
	//		}
}


void Move()
{
	
}